{
    "typer-text": [
        "für alle Bedürfnisse.",
        "von Spring inspirierte.",
        "mit dem du ⏱️ sparen kannst.",
        "um dir zu helfen.",
        "das für dich entwickelt wurde.",
        "mit ❤️ gebaut.",
        "das ⚡ schnell ist.",
        "um Speicherplatz auf dem Server zu sparen.",
        "mit Raum für deine ✨ Phantasie.",
        "für jeden Teil der Plugin-Entwicklung."
    ],
    "typer-start": "Ein Plugin-Framework, %typer%",

    "nav-source": "Quelltext",
    "nav-doc": "Dokumentation",
    "nav-javadoc": "JavaDoc",
    "nav-mvn": "Maven/Gradle",
    "nav-discord": "Discord",
    "nav-collapsed-source": "Quelltext",
    "nav-collapsed-doc": "Dokumentation",
    "nav-collapsed-javadoc": "JavaDoc",
    "nav-collapsed-mvn": "Maven/Gradle",
    "nav-collapsed-discord": "Discord",
    "soon-banner": "Bald...",

    "hero-why": "Warum Icicle?",
    "hero-gh": "GitHub",
    "hero-start": "Erste Schritte",

    "features": "Merkmale",
    "features-s1": "* Einige Funktionen sind nur durch die Installation von separaten Modulen verfügbar.",
    "features-s2": "** Einige Funktionen befinden sich in aktiver Entwicklung und sind daher möglicherweise noch nicht für die Öffentlichkeit verfügbar oder es gibt noch nicht dokumentierte Probleme..",

    "dep-inj-title": "Dependency Injection",
    "dep-inj-description": "Bist du es gewohnt, eine Dependency Injection-Lösung wie die in Spring zu verwenden? Mit Icicle bist du auf der sicheren Seite! Icicle hat eine speziell auf dieses Problem zugeschnittene Lösung für Abhängigkeiten.",

    "conf-title": "Konfigurationen",
    "conf-description": "Ein benutzerfreundliches Konfigurationssystem ist sofort einsatzbereit.\nDu musst dich nicht mit der Erstellung eines Multi-Konfigurationssystems mit Nachladen usw. befassen.-",

    "transl-title": "Übersetzungssystem",
    "transl-description": "Mehrsprachige Projekte leicht gemacht, mit einem hochgradig anpassbaren Lokalisierungssystem. Wir bieten sogar Geolokalisierung und einen speziellen Code-Parser für noch einzigartigere Lösungen.",

    "kotlin-title": "Kotlin Unterstützung",
    "kotlin-description": "Icicle unterstützt Kotlin nicht nur im Kern, sondern auch in vielen separaten Modulen, die wir anbieten. Wir haben sogar ein eigenes Modul nur für Kotlin!",

    "cmd-title": "Innovative Befehle",
    "cmd-description": "Befehle sind die wichtigste Art und Weise, wie du mit einem Plugin interagierst, deshalb müssen sie richtig gemacht sein.\nIcicle bietet ein sehr intuitives, einfach zu bedienendes, kommentargestütztes System.",
    
    "prot-title": "Protokoll",
    "prot-description": "Du kannst Menschen mit einem einzigartigen Erlebnis beeindrucken, das mit Paketen erreicht wird. Wähle unsere vordefinierten Voreinstellungen oder erstelle deine eigenen mit unserer benutzerdefinierten Protokollbibliothek!",

    "nms-title": "NMS",
    "nms-description": "Icicle kommt mit einem Interface-basierten NMS-System. Oh, und habe ich schon erwähnt, dass wir die meisten Minecraft-Klassen mit Defrost vorgerüstet haben?",

    "dev-title": "Entwicklungswerkzeuge",
    "dev-description": "Verbessere deine Entwicklung mit Icicle und nutze unsere benutzerdefinierten Entwickler-Tools für\nGradle und IntelliJ.",

    "db-title": "Datenbank Schnittstelle",
    "db-description": "Biete eine große Auswahl an Datenbanktypen an, aus denen die Serverbesitzer wählen können. Interagiere mit SQL-, NoSQL- und dateibasierten Datenbanklösungen mit unserem leichtgewichtigen Datenbank-Handler!",

    "gui-title": "GUI System",
    "gui-description": "Ein einfach zu bedienendes System zur Erstellung komplexer oder einfacher Test-UIs.",

    "ai-title": "KI-Rahmen",
    "ai-description": "Erstelle ganz einfach eigene KIs für Mobs. Lass sie Parkour oder fantastische Partikelangriffe ausführen - ganz einfach mit Code!",

    "world-title": "Welt Generator API",
    "world-description": "Wir wissen, dass es nicht einfach ist, einen eigenen Weltgenerator zu erstellen. Deshalb haben wir beschlossen, dir noch mehr zu helfen, mit einem aufgeräumten Framework und mit gebrauchsfertigen erweiterten Funktionen.",

    "utils-title": "Dienstprogramme",
    "utils-description": "Auch die Utility-Klassen von Icicle stehen dir zur Verfügung. Sie enthalten Werkzeuge und Lösungen, die du nicht mehr von StackOverflow kopieren musst.",

    "module-title": "Modulbasierte",
    "module-description": "Icicle lädt nur die Module (Abhängigkeiten) herunter, die für die Projekte benötigt werden, und spart so wertvollen Speicherplatz und macht es leicht.",

    "custom-title": "Hochgradig anpassbar",
    "custom-description": "Jeder Teil von Icicle kann angepasst werden (ja, sogar der Kern) und die eingebauten Funktionen können durch deine eigenen ersetzt werden. Der Himmel ist die Grenze, baue, was du willst!",


    "award-title": "Award winning",
    "award-description": "Icicle is an award-winning framework.\nIt has achieved <b>3rd place</b> on the national \nInnovative Informatics Competition held at Szeged, Hungary.\n\nIt has also achieved second place in the audience voting.",


    "more-title": "Viel mehr",
    "more-description": "Die Liste geht noch weiter. Die Möglichkeiten sind wirklich endlos, vor allem, wenn eine ganze Gemeinschaft dahinter steht.\nMach mit und sei ein Teil dieser Gemeinschaft!",

    "demo-title": "Du glaubst uns nicht?",
    "demo-subtitle": "Erlebe es selbst!",

    "demo-dep-title": "Dependency Injection",
    "demo-dep-description": "Mit vielen der Funktionen von Icicle, vor allem aber mit unserem Dependency Injection System, kannst du deine Produktivität in die Höhe treiben.\n\nAutowire-Dienste aus dem ServicesManager von Bukkit. Damit ist es noch einfacher, sich in bestehende APIs einzuklinken.",

    "demo-config-title": "Konfigurationen erstellen",
    "demo-config-description": "Verschwende nicht zum 100. Mal Zeit mit der Programmierung eines Konfigurations-Systems für mehrere Dateien.\nUnser intuitives Konfigurationssystem, das direkt in den Kern von Icicle integriert ist, macht dir das Leben ein bisschen leichter.\n\nSetze Standardwerte, gib Anweisungen über Kommentare und vor allem gönne dir eine Pause vom Wahnsinn der Konfigurationssysteme.",

    "demo-cmd-title": "Befehle erstellen",
    "demo-cmd-description": "Mit Icicle kannst du komplexe Interaktionen erstellen oder in kürzester Zeit einen Testbefehl zusammenstellen! Unser Befehlssystem ist so konzipiert, dass es mit automatischer Hilfegenerierung, Befehlsvorhersage und Eingabevalidierung leistungsstark ist.\n\nBehalte deine Freiheit mit Middlewares und Optionen zur Anpassung.",

    "demo-transl-title": "Innovatives Übersetzungssystem",
    "demo-transl-description": "Mach deine Übersetzer/innen glücklich mit unserem innovativen Übersetzungssystem.\nVon nun an müssen deine Übersetzer nicht mehr jede Möglichkeit hart kodieren, sondern können sie mit unserer Skriptsprache automatisieren.\n\nLege Parameter fest und lass die Übersetzer die Logik dafür schreiben, damit die Übersetzungen besser zur Sprache passen.",

    "copyright": "Copyright &copy; 2022 IceyLeagons. Alle Rechte vorbehalten."
}